package com.example.finn.Types;

import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.example.finn.PlaceAdapter;
import com.example.finn.PlaceItem;
import com.example.finn.R;

import java.util.ArrayList;


public class Family extends Fragment {

    private final ArrayList<PlaceItem> placeItems = new ArrayList<>();

    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_family, container, false);


        placeItems.add(new PlaceItem(R.drawable.green,
                "الجزيرة الخضراء", "1", "0",
                "مدينة الكويت", "https://maps.app.goo.gl/WE3viJZhSrPTzegNA",
                "هي جزيرة اصطناعية أسست من قِبَل شركة المشروعات السياحية قرب أبراج الكويت على مساحة بحرية بلغت 785 ألف مترًا مربعًا، وهي الجزيرة الصناعية الأولى في الخليج. وقطر يبلغ حوالي نصف كيلو متر، ومحيط يبلغ 3140 مترًا، ويربطها بالبر ممر طوله 134 مترًاوهي تضم برجًا سياحيًا يبلغ ارتفاعه 35 مترًا، وقلعة ترويجية للأطفال مجهزة بخنادق وشلالات مائية صغيرة، وملف عائلات حلزوني على شكل تل دائري صغير يخترقه طريق لولبي، بالإضافة إلى مطاعم ومراكز خدمات أخرى على شكل مدرج روماني."));

        placeItems.add(new PlaceItem(R.drawable.shaheed,
                "حديقة الشهيد", "2", "0",
                "مدينة الكويت", "https://maps.app.goo.gl/ZsWLHog4kuq6jxJU7",
                "أكبر حديقة حضرية في الكويت. تم افتتاح المرحلة الأولى منها في 4 مارس 2015، بينما افتتحت المرحلة الثانية في 12 أبريل 2017، وتقع الحديقة في أطراف مدينة الكويت، بمساحة إجمالية تقد بـ 220 الف متر مربع، وتضم نصب الدستور وساحة السلام ومتحف الموطن ومتحف الذكرى الذي يصف أهم معارك الكويت (مثل معركة الرقة ومعركة الصريف ومعركة الجهراء). وهو أحد أهم المشاريع التي نفذها الديوان الأميري بتميز واقتدار لإبراز صورة الكويت الحضارية. تعتبر الحديقة الشهيد أقدم الحدائق التقليدية في الكويت. وكان عائلات يطلق على حديقة الشهيد اسم حديقة «الحزام الأخضر»، حيث تم هدمها وإعادة تصميمها من جديد برؤية كويتية تضاهي أجمل الحدائق العالمية."));

        placeItems.add(new PlaceItem(R.drawable.avenuse,
                "الأفنيوز", "0", "0",
                "الري", "https://g.page/The-Avenues-Kuwait?share",
                "أكبر مجمع تجاري في الكويت . يقع المجمع في منطقة الري الصناعية على امتداد طريق الدائري الخامس من جهة الجنوب وطريق الغزالي السريع من الشرق. في عام 2013 فاز بالجائزة الذهبية لـ «أفضل مركز تسوق 2013» في منطقة الشرق الأوسط وشمال أفريقيا.\n" +
                "\n" +
                "افتتح الأڤنيوز في أبريل 2007 تحت رعاية وحضور حضرة صاحب السمو أمير البلاد الشيخ صباح الأحمد الجابر الصباح. حيث تزد تجربة التسوق في الأڤنيوز بإضافة بعد جديد لأكبر تجمع للتسوق والترفيه والذي يعد أيضًا أحد أكبر المجمعات التجارية على مستوى المنطقة. حيث يحتضن الأڤنيوز سلسلة من أشهر العلامات التجارية العالمية والمحلية الموزعة على سبعة مناطق وهي منطقة فرست أڤنيو، سكند أڤنيو، غراند أڤنيو، برستيج، سوكو، المول والسوق.\n" +
                "\n" +
                "كما يتميز الأڤنيوز بتصميم عمراني خلاب يجمع عدد من المدارس العمرانية المتنوعة، ويمنح كل منطقة هوية خاصة والمستوحاة من أعرق المدن في العالم مما يجعل من تجربة التسوق في الأڤنيوز تجربة فريدة لكل متسوق وزائر. ويتميز الأڤنيوز بمزيج من العلامات التجارية المتنوعة من أشهر دور الأزياء العالمية والمطاعم والترفيه تمتد على مساحة تأجيرية تبلغ حوالي 270 الف متر مربع، ويتضمن أكثر من 800 محل تجاري، عائلات ومواقف سيارات تسع لحوالي 10000 سيارة."));


        placeItems.add(new PlaceItem(R.drawable.center,
                "المركز العلمي", "3", "0",
                "السالمية",
                "https://goo.gl/maps/puhPkPAQQBKua6odA",
                "بدأت فكرة المركز العلمي بمبادرة من أمير الكويت الراحل الشيخ جابر الأحمد الصباح الذي كان يترأس مجلس إدارة مؤسسة الكويت للتقدم العلمي. وقد قامت المؤسسة في تنفيذ هذا المشروع الذي بلغت تكلفته خمسة وعشرين مليون دينار كويتي. وفي 17 أبريل سنة 2000 قام سمو الشيخ جابر الأحمد الصباح بافتتاح المركز العلمي الذي يقع في منطقة السالمية.\n" +
                "\n" +
                "يحتوي المركز العلمي على ثلاثة أقسام هي (الأكواريوم) وقاعة الاستكشافات وقاعة سينما (آيماكس). وهو الأول في الشرق الأوسط الذي يحتوي على هذه المرافق الثلاث. بالإضافة إلى متحف يمثل صناعة السفن عائلات التي سبق استخدامها في التجارة ونقل البضائع.\n" +
                "\n"));

        placeItems.add(new PlaceItem(R.drawable.zoo,
                "حديقة الحيوان", "4", "0",
                "العمرية",
                "https://goo.gl/maps/B4KUGLi9NkbNt9Dd6",
                "هي حديقة حيوان تقع في منطقة العمرية في محافظة الفروانية في الكويت.\n" +
                        "\n" +
                        "التاريخ\n" +
                        "أنشئت حديقة الحيوان في الكويت من بقايا حديقة سلوى الخاصة والتي كان يملكها الشيخ جابر العبد الله الجابر الصباح، فعند تصفية هذه الحديقة سلمت إلى وزارة الأشغال بعض الأسود والقرود والغزلان حيث وضعت في أقفاص مؤقتة بنفس موقع حديقة الحيوان الحالي حيث افتتحت لأول مرة في ربيع عام 1968 ومُنذ ذلك الوقت والحديقة تتطور إلى أن جاء اليوم الثاني من أغسطس من عام 1990 فكان الغزو العراقي الذي تسبب بقتل مجموعة من حيوانات الحديقة وتدمير مرافق الحديقة. عادت الحديقة كما كانت بعد التحرير كأحد المرافق الحيوية بالدولة.\n" +
                        "\n" +
                        "تُقسم الحديقة إلى أربعة مرافق :\n" +
                        "\n" +
                        "قسم المجموعة الحيوانية .\n" +
                        "قسم الخدمات والصيانة.\n" +
                        "قسم المركز الثقافي .\n" +
                        "العيادة البيطرية."));

        placeItems.add(new PlaceItem(R.drawable.shale,
                "حجز شاليهات", "5", "0",
                "الخيران",
                "https://www.mychalet.com/",
                "يمكنك حجز شالية من الخلال الوقع!"));



        RecyclerView recyclerView = v.findViewById(R.id.rv);
        recyclerView.setHasFixedSize(true);
        recyclerView.setAdapter(new PlaceAdapter(placeItems, getActivity()));
        recyclerView.setLayoutManager(new LinearLayoutManager(getActivity()));


        return v;
    }


}