package com.example.finn.Fragments;

import android.content.Intent;
import android.os.Bundle;

import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;
import androidx.appcompat.widget.SearchView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import android.widget.Toast;

import com.example.finn.PlaceAdapter;
import com.example.finn.PlaceItem;
import com.example.finn.R;

import java.util.ArrayList;
import java.util.Locale;

/**
 * A simple {@link Fragment} subclass.
 * Use the {@link Expo#newInstance} factory method to
 * create an instance of this fragment.
 */
public class Expo extends Fragment {

    private final ArrayList<PlaceItem> placeItems = new ArrayList<>();
    private SearchView searchView;
    private PlaceAdapter placeAdapter;


    // TODO: Rename parameter arguments, choose names that match
    // the fragment initialization parameters, e.g. ARG_ITEM_NUMBER
    private static final String ARG_PARAM1 = "param1";
    private static final String ARG_PARAM2 = "param2";

    // TODO: Rename and change types of parameters
    private String mParam1;
    private String mParam2;

    public Expo() {

        // Required empty public constructor
    }

    /**
     * Use this factory method to create a new instance of
     * this fragment using the provided parameters.
     *
     * @param param1 Parameter 1.
     * @param param2 Parameter 2.
     * @return A new instance of fragment Expo.
     */
    // TODO: Rename and change types and number of parameters
    public static Expo newInstance(String param1, String param2) {
        Expo fragment = new Expo();
        Bundle args = new Bundle();
        args.putString(ARG_PARAM1, param1);
        args.putString(ARG_PARAM2, param2);
        fragment.setArguments(args);
        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        if (getArguments() != null) {
            mParam1 = getArguments().getString(ARG_PARAM1);
            mParam2 = getArguments().getString(ARG_PARAM2);
        }
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
         View view = inflater.inflate(R.layout.fragment_expo, container, false);

        searchView = view.findViewById(R.id.searchView);
        searchView.clearFocus();

        SearchView.OnQueryTextListener queryTextListener = new SearchView.OnQueryTextListener(){
            @Override
            public boolean onQueryTextSubmit(String s) {
                return false;
            }
            @Override
            public boolean onQueryTextChange(String newText) {
                newText = newText.toLowerCase();
                ArrayList<PlaceItem> newList = new ArrayList<>();
                for (PlaceItem placeItem : placeItems) {
                    String title= placeItem.getTitle().toLowerCase();
                    String des= placeItem.getDes().toLowerCase();
                    String place = placeItem.getPlace().toLowerCase();
                    if(title.contains(newText) || des.contains(newText) || place.contains(newText)) {
                        newList.add(placeItem);
                    }
                }
                // create method in |
                placeAdapter.setFilter(newList);
                return true;
            }
        };





        placeItems.add(new PlaceItem(R.drawable.green,
                "الجزيرة الخضراء", "1", "0",
                "مدينة الكويت", "https://maps.app.goo.gl/WE3viJZhSrPTzegNA",
                "هي جزيرة اصطناعية أسست من قِبَل شركة المشروعات السياحية قرب أبراج الكويت على مساحة بحرية بلغت 785 ألف مترًا مربعًا، وهي الجزيرة الصناعية الأولى في الخليج. وقطر يبلغ حوالي نصف كيلو متر، ومحيط يبلغ 3140 مترًا، ويربطها بالبر ممر طوله 134 مترًاوهي تضم برجًا سياحيًا يبلغ ارتفاعه 35 مترًا، وقلعة ترويجية للأطفال مجهزة بخنادق وشلالات مائية صغيرة، وملف عائلات حلزوني على شكل تل دائري صغير يخترقه طريق لولبي، بالإضافة إلى مطاعم ومراكز خدمات أخرى على شكل مدرج روماني."));

        placeItems.add(new PlaceItem(R.drawable.shaheed,
                "حديقة الشهيد", "2", "0",
                "مدينة الكويت", "https://maps.app.goo.gl/ZsWLHog4kuq6jxJU7",
                "أكبر حديقة حضرية في الكويت. تم افتتاح المرحلة الأولى منها في 4 مارس 2015، بينما افتتحت المرحلة الثانية في 12 أبريل 2017، وتقع الحديقة في أطراف مدينة الكويت، بمساحة إجمالية تقد بـ 220 الف متر مربع، وتضم نصب الدستور وساحة السلام ومتحف الموطن ومتحف الذكرى الذي يصف أهم معارك الكويت (مثل معركة الرقة ومعركة الصريف ومعركة الجهراء). وهو أحد أهم المشاريع التي نفذها الديوان الأميري بتميز واقتدار لإبراز صورة الكويت الحضارية. تعتبر الحديقة الشهيد أقدم الحدائق التقليدية في الكويت. وكان عائلات يطلق على حديقة الشهيد اسم حديقة «الحزام الأخضر»، حيث تم هدمها وإعادة تصميمها من جديد برؤية كويتية تضاهي أجمل الحدائق العالمية."));

        placeItems.add(new PlaceItem(R.drawable.avenuse,
                "الأفنيوز", "0", "0",
                "الري", "https://g.page/The-Avenues-Kuwait?share",
                "أكبر مجمع تجاري في الكويت . يقع المجمع في منطقة الري الصناعية على امتداد طريق الدائري الخامس من جهة الجنوب وطريق الغزالي السريع من الشرق. في عام 2013 فاز بالجائزة الذهبية لـ «أفضل مركز تسوق 2013» في منطقة الشرق الأوسط وشمال أفريقيا.\n" +
                        "\n" +
                        "افتتح الأڤنيوز في أبريل 2007 تحت رعاية وحضور حضرة صاحب السمو أمير البلاد الشيخ صباح الأحمد الجابر الصباح. حيث تزد تجربة التسوق في الأڤنيوز بإضافة بعد جديد لأكبر تجمع للتسوق والترفيه والذي يعد أيضًا أحد أكبر المجمعات التجارية على مستوى المنطقة. حيث يحتضن الأڤنيوز سلسلة من أشهر العلامات التجارية العالمية والمحلية الموزعة على سبعة مناطق وهي منطقة فرست أڤنيو، سكند أڤنيو، غراند أڤنيو، برستيج، سوكو، المول والسوق.\n" +
                        "\n" +
                        "كما يتميز الأڤنيوز بتصميم عمراني خلاب يجمع عدد من المدارس العمرانية المتنوعة، ويمنح كل منطقة هوية خاصة والمستوحاة من أعرق المدن في العالم مما يجعل من تجربة التسوق في الأڤنيوز تجربة فريدة لكل متسوق وزائر. ويتميز الأڤنيوز بمزيج من العلامات التجارية المتنوعة من أشهر دور الأزياء العالمية والمطاعم والترفيه تمتد على مساحة تأجيرية تبلغ حوالي 270 الف متر مربع، ويتضمن أكثر من 800 محل تجاري، عائلات ومواقف سيارات تسع لحوالي 10000 سيارة."));


        placeItems.add(new PlaceItem(R.drawable.center,
                "المركز العلمي", "3", "0",
                "السالمية",
                "https://goo.gl/maps/puhPkPAQQBKua6odA",
                "بدأت فكرة المركز العلمي بمبادرة من أمير الكويت الراحل الشيخ جابر الأحمد الصباح الذي كان يترأس مجلس إدارة مؤسسة الكويت للتقدم العلمي. وقد قامت المؤسسة في تنفيذ هذا المشروع الذي بلغت تكلفته خمسة وعشرين مليون دينار كويتي. وفي 17 أبريل سنة 2000 قام سمو الشيخ جابر الأحمد الصباح بافتتاح المركز العلمي الذي يقع في منطقة السالمية.\n" +
                        "\n" +
                        "يحتوي المركز العلمي على ثلاثة أقسام هي (الأكواريوم) وقاعة الاستكشافات وقاعة سينما (آيماكس). وهو الأول في الشرق الأوسط الذي يحتوي على هذه المرافق الثلاث. بالإضافة إلى متحف يمثل صناعة السفن عائلات التي سبق استخدامها في التجارة ونقل البضائع.\n" +
                        "\n"));

        placeItems.add(new PlaceItem(R.drawable.zoo,
                "حديقة الحيوان", "4", "0",
                "العمرية",
                "https://goo.gl/maps/B4KUGLi9NkbNt9Dd6",
                "هي حديقة حيوان تقع في منطقة العمرية في محافظة الفروانية في الكويت.\n" +
                        "\n" +
                        "التاريخ\n" +
                        "أنشئت حديقة الحيوان في الكويت من بقايا حديقة سلوى الخاصة والتي كان يملكها الشيخ جابر العبد الله الجابر الصباح، فعند تصفية هذه الحديقة سلمت إلى وزارة الأشغال بعض الأسود والقرود والغزلان حيث وضعت في أقفاص مؤقتة بنفس موقع حديقة الحيوان الحالي حيث افتتحت لأول مرة في ربيع عام 1968 ومُنذ ذلك الوقت والحديقة تتطور إلى أن جاء اليوم الثاني من أغسطس من عام 1990 فكان الغزو العراقي الذي تسبب بقتل مجموعة من حيوانات الحديقة وتدمير مرافق الحديقة. عادت الحديقة كما كانت بعد التحرير كأحد المرافق الحيوية بالدولة.\n" +
                        "\n" +
                        "تُقسم الحديقة إلى أربعة مرافق :\n" +
                        "\n" +
                        "قسم المجموعة الحيوانية .\n" +
                        "قسم الخدمات والصيانة.\n" +
                        "قسم المركز الثقافي .\n" +
                        "العيادة البيطرية."));

        placeItems.add(new PlaceItem(R.drawable.shale,
                "حجز شاليهات", "5", "0",
                "الخيران",
                "https://www.mychalet.com/",
                "يمكنك حجز شالية من الخلال الوقع!"));

        placeItems.add(new PlaceItem(R.drawable.code,
                "الكويت تبرمج", "6", "0",
                "CODED",
                "https://code.kw/",
                "الحق سجل المقاعد محدودة!😉"+ "\n" + "\n" +"من خلال هذه المبادرة، يتعلم الطالب برمجة تطبيقات الأيفون، تطبيقات الأندرويد، مواقع الانترنت أو برمجة ألعاب الفيديو شباب، وذلك من خلال دروس مزيجة بين الفيديوهات المسجلة، والمحاضرات التي تتطلب الحضور الشخصي على مدار عدد محدد من اللقاءات."));


        placeItems.add(new PlaceItem(R.drawable.cars,
                "متحف السيارات", "7", "0",
                "الشويخ الصناعية", "https://goo.gl/maps/mppdQDsr4dN8L4sQ7",
                "متحف السيارات الكويت تم افتتاحه في 10 أكتوبر 2010، ويقع في منطقة الشويخ الصناعية بالكويت شباب، ويعرض المتحف مجموعة من السيارات الكلاسيكية و الفاخرة والقديمة، ويتكون من منطقتين، منطقة لعرض السيارات حيث يمكنك مشاهدة سيارات مختلفة، وأخرى مخصصة للأطفال لتجربة قيادة السيارات، ويعد من أكثر متاحف الكويت متعة."));

        placeItems.add(new PlaceItem(R.drawable.acuap,
                "أكوابارك", "14", "0",
                "مدينة الكويت",
                "https://goo.gl/maps/H9PvNaVi28wU1iBh7",
                "أكبر حديقة مائية في الخليج العربي بمساحة 60 ألف متر مربع ، تقع اكوا بارك الكويت على شارع الخليج العربي بجوار أبراج الكويت، وهي واحدة من أشهر ملاهي الكويت، وتعد من أفضل أماكن ترفيهية في الكويت للاطفال، تمتلك مدينة أكوا بارك الكويت مجموعة متنوعة من عوامل الجذب التي تناسب جميع الفئات العمرية اطفال شباب ، وخاصة الأطفال، مثل المنزلقات ومطاعم في متناول الأطفال الصغار، فضلاً عن مجموعة متنوعة من حمامات السباحة التي توفر العديد من الأنشطة المائية لجميع الفئات العمرية، كما أن لديها ملاعب للكرة الطائرة."));


        placeItems.add(new PlaceItem(R.drawable.mall,
                "مارينا مول", "8", "0",
                "السالمية",
                "",
                "من المعالم البارزة في دولة الكويت يقع على ضفاف الخليج العربي في منطقة السالمية، بالقرب من ماركس أند سبنسير. يضم المشروع: مجمع تجاري، فندق، إذاعة، جسر معلق للمشاة ومرسى سفن."+"يقع المجمع التجاري (مارينا مول) في منطقة السالمية على الجهة البرية الموازية لشارع الخليج العربي، يضم المجمع العديد من المحلات للمركات العالمية والمطاعم الفاخرة. منها :\n" +
                        "\n" +
                        "المتاجر الضخمة:\n" +
                        "ذ ون\n" +
                        "شوبارد\n" +
                        "ديكاثلون\n" +
                        "زارا\n" +
                        "ريفر ايلاند\n" +
                        "فكتوريا سيكريت\n" +
                        "إتش أند أم\n" +
                        "إمريكان إيجل أوتفترز\n" +
                        "المطاعم:\n" +
                        "لي نوتر\n" +
                        "ماكدونالدز\n" +
                        "برجر كنج\n" +
                        "صب واي\n" +
                        "دجاج كنتاكي\n" +
                        "مغل محل\n" +
                        "جوليبي\n" +
                        "شباب\n" +
                        "أبو جاسم\n" +
                        "كوردو\n" +
                        "باستامانيا\n" +
                        "يم يم تري\n" +
                        "دومينوز بيتزا\n" +
                        "المقاهي:\n" +
                        "ستاربكس\n" +
                        "بول\n" +
                        "سينابون\n" +
                        "كما يحتوى المجمع على ثلاث قاعات سينمائية تابعة لشركة السينما الكويتية الوطنية (سينسكيب)."));


        placeItems.add(new PlaceItem(R.drawable.kigs,
                "كيدزانيا", "12", "0",
                "الري",
                "https://g.page/KidZaniaKuwait?share",
                "مركزا ترفيهيا يقوم بتوفير بيئة تعليمية واقعية آمنة وفريدة تسمح للأطفال التي تتراوح أعمارهم ما بين 4 إلى 14 عام أن يفعلوا ما يتوارد إلى ذهنهم بالفطرة تمثيل أدوار حياتية من خلال محاكاة الأنشطة المعتادة للبالغين كما هو الحال في العالم الواقعي، يقوم الأطفال بتأدية أعمال مهنية التي تعجبهم أو التي يطمحون في أن يعملوها في المستقبل ويتم الدفع مقابل عملهم كرجل إطفاء حريق، طبيب، ضابط شرطة، صحفي، تاجر.\n" +
                        "\n" +
                        "طريقة عمل كيدزانيا\n" +
                        "تعد كيدزانيا مدينة متكاملة للأطفال حيث تحتوي على المباني والشوارع، والمحال وأنظمة الانتقال التي تستوعب 60 نشاط ووظيفة. هذا وتضم كيدزانيا أكثر المباني شهرة في أي مدينة، هذا بالإضافة إلى اقتصادها المميز المعتمد على الكيدزوس وهو عملة متعاقد عليها في كيدزانيا أي يمكن لأي طفل استخدامها في شراء أي شيء يريده بمجرد وصول الطفل إلى كيدزانيا، يتسلم شيك بقيمة 50 كيدزوس يتم صرفه حينها في بنك كيدزانيا ليتمكن الأطفال من شراء منتجات وخدمات كيدزانيا هذا وتستضيف المدينة عدد من المرافق المهنية مثل محطة الإذاعة، والمستشفى، وأجهزة محاكاة الطيران، وخدمات البريد السريع التي «يعمل» الأطفال بها، ويحصلون على راتبهم بعملة الكيدزوس بعد انتهاء النشاط"));

        placeItems.add(new PlaceItem(R.drawable.acu,
                "الأكواريوم", "13", "0",
                "السالمية",
                "https://goo.gl/maps/RGAidfwJRx3arY2x6",
                "هو جزء من المركز العلمي الكويت، ويقع في منطقة السالمية بالكويت، وتم افتتاحه من قبل الشيخ جابر الأحمد الصباح في 17 أبريل سنة 2000، يأخذك اكواريوم الكويت عبر ثلاث بيئات فريدة في شبه الجزيرة العربية: البحر والساحل والصحراء، كل واحدة منها مليئة بأنواع مختلفة من الحيوانات المحلية والنباتات والحياة البحرية التي يمكنك رؤيتها أثناء القيام بجولة، كما يحتوي على مجموعة من أحواض السمك ويبلغ سعة الحوض الرئيسي 1.5 مليون لتر ماء، تحتوي الأحواض على مجموعة متنوعة من الكائنات البحرية المختلفة  مثل القروش واللخم و الأسماك، ويعد اكواريوم الكويت أحد أفضل اماكن سياحية في الكويت للاطفال."));


        placeItems.add(new PlaceItem(R.drawable.chair,
                "الكراسي الموسيقية", "24", "0",
                "اي مكان",
                "https://translate.google.com/?sl=ar&tl=en&text=%D9%81%D9%8A%20%D8%A7%D9%84%D8%AD%D9%88%D8%B4%20%F0%9F%98%81&op=translate",
                "هذه اللعبة تناسب الأطفال والصغار أيضا وبها الكثير من المتعة، والكثير من النوستالجيا أيضا. فقد كانت لعبتنا المُفضلة قديما. فكرة اللعبة هى وضع مجموعة من الكراسي في شكل دائري، بحيث يكون عدد الكراسي أقل من عدد الأفراد. وتبدأ الموسيقى ويبدأ الأشخاص والأطفال في الدوران سريعا حول الكراسي وعندما تتوقف الموسيقى يجب أن يجلس كل طفل أو شخص على كرسي، ومن يتبقى ولم يجد كرسي ليجلس عليه يخسر. ويُعاد الأمر مرة أخرى وفي كل مرة يتم خروج شخص من اللعبة والاستغناء عن كرسي."));

        placeItems.add(new PlaceItem(R.drawable.maze,
                "لعبة المتاهة", "18", "0",
                "اي مكان",
                "https://toytheater.com/maze/",
                "لعبة مسلسة لقداء وقت ممتع!"));

        placeItems.add(new PlaceItem(R.drawable.chart,
                "Stop Complete", "19", "0",
                "اي مكان",
                "https://translate.google.com/?sl=ar&tl=en&text=%D8%A7%D9%8A%20%D9%88%D8%B1%D9%82%D8%A9%20%D9%88%D9%82%D9%84%D9%85%20%D9%85%D9%86%20%D8%B9%D9%86%D8%AF%D9%83%20%F0%9F%98%84&op=translate",
                "هل تعرفين هذه اللعبة؟ إنها لعبة أوتوبيس كومبليت الشهيرة التي كنا دائما نلعبها ونحن صغار. ومن الواضح أننا لم نعي اسمها جيدا فالجملة بالإنجليزي تقول Stop, It's Complete أو توقف فقد انتهيت. وهذا الاسم هو الفكرة الرئيسية للعبة، فكل لاعب يحتاج لورقة وقلم ويقوم برسم جدول به عدة خانات، ويكتب البيانات التالية، اسم ولد واسم بنت وجماد وحيوان وبلد وأكلة ومشهور. وتختار المجموعة حرف ليقوم الجميع بملىء كل هذه البيانات بكلمات تبدأ بهذا الحرف. ومن ينتهي أولا يقول Stop, It's Complete. ويتم حساب النقاط كالآتي، الاسم الفريد لأي بيان يأخذ 10 والمتكرر 5 والفارغ صفر، ثُم يتم جمع النقاط في كل مرة لكل لاعب وهكذا."));


        placeItems.add(new PlaceItem(R.drawable.tech,
                "تك زون", "25", "0",
                "الري",
                "https://g.page/tekzoneme?share",
                "تستطيع الاستمتاع بالعديد من الأنشطة المميزة في ملاهي تك زون، فهي تُعتبر افضل مدينة العاب في الكويت ومن أكثرها جذباً حيث يعثُر مُرتادوها على باقة مُتنوّعة من الألعاب الكهربائية، فيما يُمضي فيها الأطفال أوقاتاً مُسليّة مستمتعين بالألعاب التي خُصصت لهم ولهذا فإن هذه الملاهي تُعد مكان مثالي للجميع لما توفره من أنشطة متنوّعة تُمتع كل الزوّار من مختلف الفئات العُمرية.\n" +
                        "\n" +
                        "احرص خلال زيارتك لهذه الملاهي على أن تقوم بجولة مميزة في افنيوز مول حيث توجد هذه الملاهي بداخله ."));

        placeItems.add(new PlaceItem(R.drawable.magic,
                "كويت ماجك", "26", "0",
                "المنقف",
                "https://goo.gl/maps/hJeevmTNkLhbmMSs5",
                "مكان مفتوح بجانب. مجمع كويت ماجيك يوجد الكثير من الألعاب للكبار خطره وسريعه ويوجد أيضا الألعاب للصغار قريبه من بعضها. وكما يؤجر صالات. مغلقه تحتوي على الكثر من ألعاب للصغار من عمر سنه الي ٤ سنوات. وصاله أخرى فيها ألعاب للكبار ليست خطيرة ولكنها مسليه."));

        placeItems.add(new PlaceItem(R.drawable.sky,
                "Sky Zone", "27", "0",
                "مدية الكويت",
                "https://goo.gl/maps/U9xxHkccZTg1gPFTA",
                "متنزه سكاي زون ترامبولين SkyZone Trampoline Park من اهم اماكن السياحة في الكويت فهو أول مدينة ترفيهية مغلقة تضم العديد من الأنشطة البدنية في الكويت\n" +
                        "\n" +
                        "وقد تم افتتاح المتنزه في عام 2015م، ويتضمن عدة ملاعب للقفز، وكرة السلة، وحلبات مصارعة، والتسلق، وغيرها من الأنشطة الرياضية.\n" +
                        "\n" +
                        "ويقع المتنزه في منطقة الرابية من مدينة الكويت وتم تخصيص عدة أجزاء منه تتناسب مع الأطفال من عمر 3 سنوات.\n" +
                        "\n" +
                        "كما يتضمن متنزه سكاي زون ترامبولين حديقة تزلج، وألعاب القفز والهبوط المتطرفة، وحفرة الرغوة، والطوق والكرة، والعديد من أنواع السباقات."));




        placeAdapter = new PlaceAdapter(placeItems, getContext());

        RecyclerView recyclerView = view.findViewById(R.id.rv);
        recyclerView.setHasFixedSize(true);
        recyclerView.setAdapter(placeAdapter);
        recyclerView.setLayoutManager(new LinearLayoutManager(getActivity()));

        searchView.setOnQueryTextListener(queryTextListener);

        return view;
    }






}